In [14]:
#  1. Provide summary statistics (mean, median, minimum, maximum, standard
# deviation) for a dataset (age, income etc.) with numeric variables grouped by
# one of the qualitative (categorical) variable. For example, if your categorical
# variable is age groups and quantitative variable is income, then provide
# summary statistics of income grouped by the age groups. Create a list that
# contains a numeric value for each response to the categorical variable.

In [15]:
import pandas as pd
import numpy as np
student = pd.read_csv("D:\StudentsPerformance.csv")

In [16]:
student.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   gender                       1000 non-null   object
 1   race/ethnicity               1000 non-null   object
 2   parental level of education  1000 non-null   object
 3   lunch                        1000 non-null   object
 4   test_preparation_course      1000 non-null   object
 5   math_score                   991 non-null    float64
 6   reading_score                995 non-null    float64
 7   writing_score                994 non-null    float64
dtypes: float64(3), object(5)
memory usage: 62.6+ KB

In [17]:
student.describe()

       math_score  reading_score  writing_score
count  991.000000     995.000000     994.000000
mean    66.116044      69.223116      68.113682
std     15.217867      14.577775      15.182945
min      0.000000      17.000000      10.000000
25%     57.000000      59.000000      58.000000
50%     66.000000      70.000000      69.000000
75%     77.000000      79.000000      79.000000
max    100.000000     100.000000     100.000000

In [18]:
student.head()

,gender,race/ethnicity,parental level of education,lunch,test_preparation_course,math_score,reading_score,writing_score
0,female,group B,bachelor's degree,standard,none,72.0,72.0,74.0
1,female,group C,some college,standard,completed,69.0,90.0,88.0
2,female,group B,master's degree,standard,none,90.0,95.0,93.0
3,male,group A,associate's degree,free/reduced,none,47.0,57.0,44.0
4,male,group C,some college,standard,none,76.0,78.0,75.0

In [19]:
male_female = student.groupby('gender')['gender'].count()

print(male_female)

gender
female    518
male      482
Name: gender, dtype: int64

In [20]:
math_match=student.groupby('gender').math_score.mean()

print(math_match)

gender
female    63.654902
male      68.725572
Name: math_score, dtype: float64

In [21]:
mean_math_test_preparation_course=student.groupby(['gender','test_preparation_course']).math_score.mean()

print(mean_math_test_preparation_course)

gender  test_preparation_course
female  completed                  67.331492
        none                       61.632219
male    completed                  72.339080
        none                       66.677524
Name: math_score, dtype: float64

In [22]:
student.math_score.unique()

array([ 72.,  69.,  90.,  47.,  76.,  71.,  88.,  40.,  64.,  38.,  58.,
        nan,  78.,  50.,  18.,  46.,  54.,  66.,  65.,  44.,  74.,  73.,
        70.,  62.,  63.,  56.,  97.,  81.,  75.,  57.,  55.,  53.,  59.,
        82.,  77.,  33.,  52.,   0.,  79.,  39.,  67.,  45.,  60.,  61.,
        41.,  49.,  30.,  80.,  42.,  27.,  43.,  68.,  85.,  98.,  87.,
        51.,  99.,  84.,  91.,  83.,  89.,  22., 100.,  96.,  94.,  48.,
        35.,  34.,  86.,  92.,  37.,  28.,  24.,  26.,  95.,  36.,  29.,
        32.,  93.,  19.,  23.,   8.])

In [23]:
# Group by of a Single Column and Apply the describe()
# Method on a Single Column

In [24]:
print(student.groupby('gender').math_score.describe())

        count       mean        std   min   25%   50%   75%    max
gender
female  510.0  63.654902  15.593640   0.0  54.0  65.0  74.0  100.0
male    481.0  68.725572  14.371106  27.0  59.0  69.0  79.0  100.0

In [25]:
groups=pd.cut(student['math_score'],bins=6)

print(groups)

0      (66.667, 83.333]
1      (66.667, 83.333]
2       (83.333, 100.0]
3        (33.333, 50.0]
4      (66.667, 83.333]
             ...
995     (83.333, 100.0]
996      (50.0, 66.667]
997      (50.0, 66.667]
998    (66.667, 83.333]
999    (66.667, 83.333]
Name: math_score, Length: 1000, dtype: category
Categories (6, interval[float64, right]): [(-0.1, 16.667] < (16.667, 33.333] < (33.333, 50.0] < (50.0, 66.667] < (66.667, 83.333] < (83.333, 100.0]]

In [26]:
student.groupby(groups)['math_score'].count()

math_score
(-0.1, 16.667]        2
(16.667, 33.333]     18
(33.333, 50.0]      130
(50.0, 66.667]      351
(66.667, 83.333]    362
(83.333, 100.0]     128
Name: math_score, dtype: int64

In [27]:
pd.crosstab(groups,student['gender'])

gender            female  male
math_score
(-0.1, 16.667]         2     0
(16.667, 33.333]      14     4
(33.333, 50.0]        81    49
(50.0, 66.667]       194   157
(66.667, 83.333]     172   190
(83.333, 100.0]       47    81

In [28]:
# 2.Write a Python program to display some basic
# statistical details like percentile, mean, standard
# deviation etc. of the species of ‘Iris-setosa’,‘Iris-versicolor’ and 'Iris-versicolor’ of iris.csv dataset.

In [29]:
import statistics as st

In [30]:
data=[1,2,3,4,5,6]

In [31]:
st.mean(data)

3.5

In [32]:
st.median(data)

3.5

In [33]:
data1=[1,2,7,5,4,7,8,2,1,7]
st.mode(data1)

7

In [34]:
st.variance(data)

3.5

In [35]:
import pandas as pd

In [36]:
df=pd.DataFrame(data)
print(df)

   0
0  1
1  2
2  3
3  4
4  5
5  6

In [37]:
df.mean()

0    3.5
dtype: float64

In [38]:
df.median()

0    3.5
dtype: float64

In [39]:
#Variance
st.variance(data1)

7.6

In [40]:
import pandas as pd
df = pd.DataFrame(data1)

In [41]:
df.mean()

0    4.4
dtype: float64

In [42]:
df.mode()

   0
0  7

In [43]:
df.median()

0    4.5
dtype: float64

In [44]:
#using California housing train csv file
df1 = pd.read_csv("D:\HousingData.csv")
df1

,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT,MEDV
0,0.00632,18.0,2.31,0.0,0.538,6.575,65.2,4.0900,1,296,15.3,396.90,4.98,24.0
1,0.02731,0.0,7.07,0.0,0.469,6.421,78.9,4.9671,2,242,17.8,396.90,9.14,21.6
2,0.02729,0.0,7.07,0.0,0.469,7.185,61.1,4.9671,2,242,17.8,392.83,4.03,34.7
3,0.03237,0.0,2.18,0.0,0.458,6.998,45.8,6.0622,3,222,18.7,394.63,2.94,33.4
4,0.06905,0.0,2.18,0.0,0.458,7.147,54.2,6.0622,3,222,18.7,396.90,NaN,36.2
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
501,0.06263,0.0,11.93,0.0,0.573,6.593,69.1,2.4786,1,273,21.0,391.99,NaN,22.4
502,0.04527,0.0,11.93,0.0,0.573,6.120,76.7,2.2875,1,273,21.0,396.90,9.08,20.6
503,0.06076,0.0,11.93,0.0,0.573,6.976,91.0,2.1675,1,273,21.0,396.90,5.64,23.9
504,0.10959,0.0,11.93,0.0,0.573,6.794,89.3,2.3889,1,273,21.0,393.45,6.48,22.0
505,0.04741,0.0,11.93,0.0,0.573,6.030,NaN,2.5050,1,273,21.0,396.90,7.88,11.9

In [45]:
df1.mean()

CRIM         3.611874
ZN          11.211934
INDUS       11.083992
CHAS         0.069959
NOX          0.554695
RM           6.284634
AGE         68.518519
DIS          3.795043
RAD          9.549407
TAX        408.237154
PTRATIO     18.455534
B          356.674032
LSTAT       12.715432
MEDV        22.532806
dtype: float64

In [46]:
df1['TAX'].mean()

408.2371541501976

In [47]:
df1['TAX'].mode()

0    666
Name: TAX, dtype: int64

In [48]:
df1['TAX'].median()

330.0

In [49]:
df1['TAX'].var()

28404.759488122803

In [50]:
st.stdev(df1["TAX"])

168.53711605495903

# Descriptive Statistics on IRIS dataset

In [51]:
import pandas as pd
data = pd.read_csv("D:\iris.csv")
print('Iris-setosa')

Iris-setosa

In [52]:
setosa = data['species'] == 'Iris-setosa'
print(data[setosa].describe())

       sepal_length  sepal_width  petal_length  petal_width
count           0.0          0.0           0.0          0.0
mean            NaN          NaN           NaN          NaN
std             NaN          NaN           NaN          NaN
min             NaN          NaN           NaN          NaN
25%             NaN          NaN           NaN          NaN
50%             NaN          NaN           NaN          NaN
75%             NaN          NaN           NaN          NaN
max             NaN          NaN           NaN          NaN

In [53]:
print('\nIris-versicolor')
setosa = data['species'] == 'Iris-versicolor'
print(data[setosa].describe())

Iris-versicolor
       sepal_length  sepal_width  petal_length  petal_width
count           0.0          0.0           0.0          0.0
mean            NaN          NaN           NaN          NaN
std             NaN          NaN           NaN          NaN
min             NaN          NaN           NaN          NaN
25%             NaN          NaN           NaN          NaN
50%             NaN          NaN           NaN          NaN
75%             NaN          NaN           NaN          NaN
max             NaN          NaN           NaN          NaN

In [54]:
print('\nIris-virginica')
setosa = data['species'] == 'Iris-virginica'
print(data[setosa].describe())

Iris-virginica
       sepal_length  sepal_width  petal_length  petal_width
count           0.0          0.0           0.0          0.0
mean            NaN          NaN           NaN          NaN
std             NaN          NaN           NaN          NaN
min             NaN          NaN           NaN          NaN
25%             NaN          NaN           NaN          NaN
50%             NaN          NaN           NaN          NaN
75%             NaN          NaN           NaN          NaN
max             NaN          NaN           NaN          NaN